ahmedbody/baseFile_OF_mesh/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        // Name of new patch
        name slipPatch;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (floor);

        // If constructFrom = set : name of faceSet
        set f_slip;
    }

    {
        name inlet;

        patchInfo
        {
          type patch;
        }

        constructFrom patches;

        patches (auto0);

    }

    {
        name outlet;

        patchInfo
        {
          type patch;
        }

        constructFrom patches;

        patches (auto7);

    }

  /*  {
        name entranceFloor;

        patchInfo
        {
          type wall;
        }

        constructFrom patches;

        patches (auto1);

    }*/

    {
        name step;

        patchInfo
        {
          type wall;
        }

        constructFrom patches;

        patches (auto5);

    }

    {
        name floor;

        patchInfo
        {
          type wall;
        }

        constructFrom patches;

        patches (auto6);

    }

    {
        name top;

        patchInfo
        {
          type wall;
        }

        constructFrom patches;

        patches (auto4);

    }

    {
        name front;

        patchInfo
        {
          type empty;
        }

        constructFrom patches;

        patches (auto3);

    }

    {
        name back;

        patchInfo
        {
          type empty;
        }

        constructFrom patches;

        patches (auto2);

    }



);


// ************************************************************************* //
