ahmedbody/baseFile_OF_mesh/system/gradients
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

#include "functions/functionInputs"


gradU
{
    type            grad;
    libs            (fieldFunctionObjects);

    field U;


    writePrecision  $writePrec;
    writeToFile     $writeToFile;
    useUserTime     $useUserTime;
    log             $logged;
    timeStart       $tStart;
    timeEnd         $tEnd;
    executeControl  $executeCon;
    executeInterval $executeInt;
    writeControl    $writeCon;
    writeInterval   $writeInt;
}

gradp
{
    type            grad;
    libs            (fieldFunctionObjects);

    field p;


    writePrecision  $writePrec;
    writeToFile     $writeToFile;
    useUserTime     $useUserTime;
    log             $logged;
    timeStart       $tStart;
    timeEnd         $tEnd;
    executeControl  $executeCon;
    executeInterval $executeInt;
    writeControl    $writeCon;
    writeInterval   $writeInt;
}

gradOmega
{
    type            grad;
    libs            (fieldFunctionObjects);

    field omega;


    writePrecision  $writePrec;
    writeToFile     $writeToFile;
    useUserTime     $useUserTime;
    log             $logged;
    timeStart       $tStart;
    timeEnd         $tEnd;
    executeControl  $executeCon;
    executeInterval $executeInt;
    writeControl    $writeCon;
    writeInterval   $writeInt;
}

gradk
{
    type            grad;
    libs            (fieldFunctionObjects);

    field k;


    writePrecision  $writePrec;
    writeToFile     $writeToFile;
    useUserTime     $useUserTime;
    log             $logged;
    timeStart       $tStart;
    timeEnd         $tEnd;
    executeControl  $executeCon;
    executeInterval $executeInt;
    writeControl    $writeCon;
    writeInterval   $writeInt;
}
