ahmedbody/baseFile_OF_mesh/system/sampleCp
type            patchProbes;
libs            (sampling);
writeControl    writeTime;

patch           lowerWall;
probeLocations  ();
fields          (cp);
